# grep "^([0-9]\{3\})\s[0-9]\{3\}-[0-9]\{4\}\b\|^[0-9]\{3\}-[0-9]\{3\}-[0-9]\{4\}$" file.txt
#
# 作者：dizent
# 链接：https://leetcode-cn.com/problems/valid-phone-numbers/solution/maczheng-ze-biao-da-shi-hao-xiang-he-ni-men-de-bu-/
# 来源：力扣（LeetCode）
# 著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。

# grep -P '^(\d{3}-|\(\d{3}\) )\d{3}-\d{4}$' file.txt
# sed -n -r '/^([0-9]{3}-|\([0-9]{3}\) )[0-9]{3}-[0-9]{4}$/p' file.txt
# awk '/^([0-9]{3}-|\([0-9]{3}\) )[0-9]{3}-([0-9]{4})$/' file.txt

# grep "^\(([0-9]\{3\}) \|[0-9]\{3\}-\)[0-9]\{3\}-[0-9]\{4\}$" file.txt
#
# 注意""不要丢了，其中的空格，()是普通字符，" "不要丢了
# ^：表示行首，以...开始，这里表示以(xxx) 或者xxx-开始，注意空格
# ()：选择操作符，要么是([0-9]\{3\}) ，要么是[0-9]\{3\}-
# |：或者连接操作符，表示或者
# []：单字符占位，[0-9]表示一位数字
# {n}：匹配n位，[0-9]\{3\}匹配三位连续数字
# $：表示行尾，结束
